[{"_id":"5b346657e404d60e37311374","number":0,"season":1,"title":"Preview","__v":0,"fileName":"Game of Thrones S01E00.mp4","description":"Preview & Trailer Episode","show":"5b1c0f2f9fa7cda247ed23ae"},{"_id":"5b3466b8e404d60e37311376","number":1,"season":1,"title":"Winter is Coming","__v":0,"fileName":"Game of Thrones S01E01.mp4","description":"Jon Arryn, the Hand of the King, is dead. King Robert Baratheon plans to ask his oldest friend, Eddard Stark, to take Jon's place. Across the sea, Viserys Targaryen plans to wed his sister to a nomadic warlord in exchange for an army.","show":"5b1c0f2f9fa7cda247ed23ae"},{"_id":"5b3466dee404d60e37311377","number":2,"season":1,"title":"The Kingsroad","__v":0,"fileName":"Game of Thrones S01E02.mp4","description":"While Bran recovers from his fall, Ned takes only his daughters to King's Landing. Jon Snow goes with his uncle Benjen to the Wall. Tyrion joins them.","show":"5b1c0f2f9fa7cda247ed23ae"},{"_id":"5b3466fce404d60e37311378","number":3,"season":1,"title":"Lord Snow","__v":0,"fileName":"Game of Thrones S01E03.mp4","description":"Lord Stark and his daughters arrive at King's Landing to discover the intrigues of the king's realm.","show":"5b1c0f2f9fa7cda247ed23ae"},{"_id":"5b34671be404d60e37311379","number":4,"season":1,"title":"Cripples, Bastards, and Broken Things","__v":0,"fileName":"Game of Thrones S01E04.mp4","description":"Eddard investigates Jon Arryn's murder. Jon befriends Samwell Tarly, a coward who has come to join the Night's Watch.","show":"5b1c0f2f9fa7cda247ed23ae"},{"_id":"5b346747e404d60e3731137a","number":5,"season":1,"title":"The Wolf and the Lion","__v":0,"fileName":"Game of Thrones S01E05.mp4","description":"Catelyn has captured Tyrion and plans to bring him to her sister, Lysa Arryn, at the Vale, to be tried for his, supposed, crimes against Bran. Robert plans to have Daenerys killed, but Eddard refuses to be a part of it and quits.","show":"5b1c0f2f9fa7cda247ed23ae"},{"_id":"5b346768e404d60e3731137b","number":6,"season":1,"title":"A Golden Crown","__v":0,"fileName":"Game of Thrones S01E06.mp4","description":"While recovering from his battle with Jaime, Eddard is forced to run the kingdom while Robert goes hunting. Tyrion demands a trial by combat for his freedom. Viserys is losing his patience with Drogo.","show":"5b1c0f2f9fa7cda247ed23ae"},{"_id":"5b52fbcee404d60e37311396","number":1,"season":2,"title":"The North Remembers","__v":0,"fileName":"Game of Thrones S02E01.mp4","description":"To Cersei's dismay, Tyrion takes up his post as acting Hand at King's Landing. At Dragonstone, Stannis proclaims allegiance to Melisandre's new god and lays public claim to the Iron Throne, revealing Joffrey's bastardy. The latter orders the soldiers to slaughter Robert's bastards, one of whom, named Gendry, manages to escape King's Landing along with Arya. Having won three victories, Robb offers the Lannisters peace in exchange for the North's independence and Sansa's return, sending Theon to gain the support of Balon, his father, and Catelyn to seek alliance with Renly, who also claims the throne. Beyond the Wall, the Night's Watch finds shelter with Craster and his daughters/wives. In Essos, as her people slowly die in the Red Waste, Daenerys sends out riders for reconnaissance.","show":"5b1c0f2f9fa7cda247ed23ae"},{"_id":"5b52fbf7e404d60e37311397","number":2,"season":2,"title":"The Night Lands","__v":0,"fileName":"Game of Thrones S02E02.mp4","description":"Returning to his home of Pyke after nine years as the Starks' ward, Theon is reunited with his sister, Yara, and Balon, who despises Theon for his Northern ways and intends to win back his crown by force. Cersei rejects Robb's terms and Tyrion exiles Slynt, head of the Gold Cloaks, to the Wall, promoting Bronn to commander of the watch. On the road to the Wall, Arya reveals her true identity to Gendry. North of the Wall, Tarly is approached by one of Craster's daughters, Gilly, who is pregnant and fears for her unborn son; Snow is reluctant to help her despite Tarly's pleas. In the Red Waste, one of the horses returns to Daenerys with the severed head of its rider in a pouch, a message from one of her enemies. In Dragonstone, Davos, Stannis's henchman, recruits the pirate Salladhor Saan to Stannis' side, and the latter has sex with Melisandre to obtain the son his wife cannot give him. Snow discovers that Craster sacrifices his sons to the White Walkers; in response, Craster knocks Snow unconscious.","show":"5b1c0f2f9fa7cda247ed23ae"},{"_id":"5b52fc24e404d60e37311398","number":3,"season":2,"title":"What Is Dead May Never Die","__v":0,"fileName":"Game of Thrones S02E03.mp4","description":"Catelyn arrives at Renly's camp to negotiate an alliance, watching the female warrior Brienne of Tarth winning the right to join Renly's guard. Renly has recently married Margaery, Loras's sister, but refuses to have sex with her due to having feelings for Loras. In the Iron Islands, Balon makes a plan to attack the North, led by Yara. After burning a letter warning Robb of Balon's impending attack, Theon re-joins the Greyjoys in a water-based ceremony. In King's Landing, Tyrion crafts a plan to find who is in Cersei's confidence; finding it to be Pycelle, whom the former imprisons. Tyrion assigns his prostitute, Shae, as handmaiden to Sansa. Beyond the Wall, Craster demands the Night's Watchmen leave. Snow finds out that Jeor already knew about Craster's felonies. On the road to the wall, the band of Night's Watch recruits are attacked by Lannister soldiers. Yoren is killed and Arya is taken prisoner. The latter states that Gendry was a boy already killed.","show":"5b1c0f2f9fa7cda247ed23ae"},{"_id":"5b52fc43e404d60e37311399","number":4,"season":2,"title":"Garden of Bones","__v":0,"fileName":"Game of Thrones S02E04.mp4","description":"Catelyn tries to convince the Baratheon brothers to abandon their quarrel and unite against the Lannisters; but Stannis demands Renly submit to his command. Baelish visits her and offers a trade of Jaime for her daughters. Melisandre gives birth to a shadow creature. Sansa is abused by Joffrey in revenge for Robb's victories. Tyrion intervenes and in return, Joffrey is cruel to the prostitutes Tyrion sends him as \"gifts\". Tyrion releases Pycelle, but fires him from the Small Council. Tyrion also finds out about the incestuous relationship between Cersei and their cousin, Lancel, forcing the latter to spy on her by threatening to reveal it to Joffrey. Arya and Gendry are taken as captives to the castle of Harrenhal, where prisoners are tortured until death. Tywin arrives and stops the torture, picking her as his servant without knowing about her true identity. After her exhausting journey through the desert, Daenerys arrives at the gates of the prosperous city of Qarth, where Daxos, a member of the Council of Thirteen, convinces the others to let her caravan enter the city.","show":"5b1c0f2f9fa7cda247ed23ae"},{"_id":"5b52fc78e404d60e3731139a","number":5,"season":2,"title":"The Ghost of Harrenhal","__v":0,"fileName":"Game of Thrones S02E05.mp4","description":"H'ghar, one of the three caged prisoners Arya saved, pledges to kill three people of her choosing in order to repay his debt to her. She accepts and first chooses the Tickler, the man who mortally tortured the captives. After Renly's death at the hands of Melisandre's shadowy assassin, Catelyn and Brienne, who are accused of the murder, are forced to flee from the camp. Excluding the Tyrells, Renly's forces submit to Stannis. Brienne swears loyalty to Catelyn. Theon sails from Pyke prepared to prove that he is a true Ironborn, with plans to capture Winterfell while Robb is absent. Tyrion learns from Lancel about the Wildfire, a burning substance mass produced to destroy Stannis' fleet and army during the upcoming siege. Tyrion takes control of the scheme. The Night's Watch arrives at an ancient fortress called the Fist of the First Men, where Jeor allows Snow to join the team led by a veteran named Halfhand in order to kill the enemy leader. In Qarth, Daxos proposes marriage to Daenerys in exchange for providing her with the wealth to conquer the Seven Kingdoms. Jorah convinces her to gain the support of the Westerosi people instead.","show":"5b1c0f2f9fa7cda247ed23ae"},{"_id":"5b52fc96e404d60e3731139b","number":6,"season":2,"title":"The Old Gods and the New","__v":0,"fileName":"Game of Thrones S02E06.mp4","description":"Myrcella, Cersei's daughter, is sent away from King's Landing. Theon manages to take Winterfell and executes Cassel, a henchman, for insulting him. Osha, the captured wildling, helps Brandon and Rickon escape. Robb reunites with the healer Maegyr. At the Fist of the First Men, Snow captures a Wildling named Ygritte, but gets separated from his patrol when she tries to escape and he is forced to chase her. Joffrey incites a riot at King's Landing, in which he is nearly killed and Sansa is nearly raped. Tywin allows Baelish to seek the allegiance of the Tyrells. An officer suspects Arya; and she has H'ghar kill him. Robb receives news of Theon's plans and sends men to retake Winterfell. At Qarth, Daenerys tries to procure a ship to take her people to Westeros, all the while keeping Daxos at bay. Daenerys' dragons are stolen.","show":"5b1c0f2f9fa7cda247ed23ae"},{"_id":"5b52fcb9e404d60e3731139c","number":7,"season":2,"title":"A Man Without Honor","__v":0,"fileName":"Game of Thrones S02E07.mp4","description":"Theon begins tracking Brandon and Rickon. Tywin begins searching Harrenhal for his officer's murderer. Ygritte continues her attempts to seduce Snow and, after a momentary lapse in Jon's concentration, she escapes and leads him into a trap. Still shaken from the riot, Sansa is horrified when she awakens to find that she has had her first menstruation and can thus bear Joffrey's children. Cersei warns her to love no one but her children, not even Joffrey. In Robb's camp, a failed escape attempt by Jaime leaves a guard dead, with some soldiers seeking retribution. In Qarth, the warlock Pree reveals to Daenerys that he stole her dragons, but gives her the opportunity to reunite with them before slaughtering the Council of Thirteen and establishing Daxos as the king. Theon presents to Luwin and his subjects the charred corpses of two boys, claiming that he has tracked down and killed Brandon and Rickon.","show":"5b1c0f2f9fa7cda247ed23ae"},{"_id":"5b52fcede404d60e3731139d","number":8,"season":2,"title":"The Prince of Winterfell","__v":0,"fileName":"Game of Thrones S02E08.mp4","description":"Robb learns that Catelyn has secretly freed Jaime, now escorted by Brienne, in order to ransom Sansa and Arya; he locks her in her tent and sends men to find them, also entering into a romantic relationship with Talisa. Yara arrives at Winterfell to bring Theon back to Pyke, criticizing him for his actions. Tywin leaves Harrenhal to attack Robb, which leads Arya, Gendry and their friend Hot Pie to attempt an escape with the help of H'ghar, who agrees in order for Arya to refrain from naming H'ghar himself as the third man to kill. In King's Landing, Cersei attempts to blackmail Tyrion by abducting the prostitute, Ros, whom the former believes to be his secret lover. On the way to King's Landing, Stannis promises Davos to make him his Hand of the King. Beyond the Wall, the Wildling leader \"Rattleshirt\" leads the captured Snow and Halfhand to his king, Rayder. At the Fist of the First Men, the brothers of the Night's Watch find a hidden cache of dragonglass. In Qarth, Jorah agrees to accompany Daenerys into the House of the Undying to retrieve her dragons. Brandon and Rickon are revealed to be alive and hiding in Winterfell.","show":"5b1c0f2f9fa7cda247ed23ae"},{"_id":"5b52fd19e404d60e3731139e","number":9,"season":2,"title":"Blackwater","__v":0,"fileName":"Game of Thrones S02E09.mp4","description":"Baratheon's fleet assaults King's Landing. Leading the defense, Tyrion destroys many of the attacking ships with an exploding ship full of wildfire, forcing the former to attack on land. Sandor leads the defense outside the gate, but is defeated and returns inside, denouncing Joffrey and leaving. Joffrey also escapes. Tyrion convinces the Gold Cloaks to fight with him. Baratheon's forces make it inside the castle, but Tyrion leads his men behind the Baratheon forces via underground tunnels and attacks. Cersei goes to the throne room with Tommen, intending to kill him. Shae convinces Sansa to go to her chamber, where Sandor offers to take her back to Winterfell; but she decides to stay. As Tyrion is wounded and Cersei is about to poison Tommen, Tywin's forces, joined by Loras, arrive and defeat Baratheon's forces, with the latter forced to retreat.","show":"5b1c0f2f9fa7cda247ed23ae"},{"_id":"5b52fd43e404d60e3731139f","number":10,"season":2,"title":"Valar Morghulis","__v":0,"fileName":"Game of Thrones S02E10.mp4","description":"Joffrey sets Sansa aside in favor of marrying Margaery while Tyrion fears for his and Shae's safety now that Tywin has replaced him as Hand and relieved Bronn from his command. Melisandre gives Stannis a new hope. Brienne and Jaime are spotted by three Stark soldiers, whom she kills. Catelyn fails to dissuade Robb from marrying Talisa. In Qarth, Daenerys ventures into the House of the Undying and successfully retrieves her dragons, who kill Pree. She then seals Daxos inside his own vault and claims his wealth for herself. In Winterfell, Theon tries to convince his men to fight Robb's army, but is knocked unconscious by them, who decide to leave. A dying Luwin convinces Brandon's party to go to the Wall. Arya, having escaped Harrenhal with Hot Pie and Gendry, receives the gift of a valuable coin from H'ghar, who magically changes his face. North of the Wall, Halfhand forces Snow to kill him to prove his loyalty to the wildlings while an army of White Walkers surrounds the Fist of the First Men.","show":"5b1c0f2f9fa7cda247ed23ae"},{"_id":"5b530cb7e404d60e373113be","number":1,"season":3,"title":"Valar Dohaeris","__v":0,"fileName":"Game of Thrones S03E01.mp4","description":"Some of the Night's Watchmen, including Tarly and Mormont, survive the White Walkers' attack and pledge to return to the Wall to warn the Seven Kingdoms. Snow is brought before Rayder, the \"King beyond the Wall\", and pledges his loyalty to the Wildlings. A scarred Tyrion tries to get Casterly Rock from Tywin, who promises other things instead. Margaery engages in charity work with the orphans of King's Landing. Baelish offers to help Sansa escape King's Landing. Ros advises Shae not to trust him. Davos is rescued by Saan, who does not want any more connections with Stannis, and returns to Dragonstone, where he unsuccessfully tries to kill Melisandre, who blames him for convincing Stannis not to let her join the battle, and is imprisoned. In Essos, Daenerys arrives in the city of Astapor to buy an army of brutally-trained slave soldiers, the \"Unsullied\". The warlocks of Qarth attempt to assassinate her, but she is saved by Selmy, the former Kingsguard commander, who pledges his loyalty.","show":"5b1c0f2f9fa7cda247ed23ae"},{"_id":"5b530cd2e404d60e373113bf","number":2,"season":3,"title":"Dark Wings, Dark Words","__v":0,"fileName":"Game of Thrones S03E02.mp4","description":"Brienne continues escorting Jaime across the Riverlands to King's Landing. He engages her in a fight, which is interrupted by Bolton soldiers. After receiving the news of the sack of Winterfell and the disappearance of Bran and Rickon, Robb diverts his attentions from the war against the Lannisters to attend Catelyn's father's funeral in Riverrun, angering Karstark, who seeks vengeance for his sons who were killed by the Lannisters. Arya, Gendry and Hot Pie also make for Riverrun, but are waylaid by a rebel group, the \"Brotherhood without Banners\", and are taken to an inn, where the captured Clegane reveals Arya's identity. Margaery and her grandmother Olenna, the \"Queen of Thorns\", convince Sansa to tell them about Joffrey's flawed character. Theon is tortured by unknown captors. Bran, Rickon, Osha and Hodor encounter the siblings Jojen and Meera, children of the Stark bannerman Howland. Jojen, who has been sharing Bran's strange dreams, tells him that he is a warg, able to enter the minds of animals.","show":"5b1c0f2f9fa7cda247ed23ae"},{"_id":"5b530cf4e404d60e373113c0","number":3,"season":3,"title":"Walk of Punishment","__v":0,"fileName":"Game of Thrones S03E03.mp4","description":"Robb and Catelyn attend the funeral in Riverrun. Tywin decides to send Baelish to Lysa intending to have them married in order to secure her alliance, making Tyrion the new Master of Coin. While Hot Pie decides to stay at the inn, Arya and Gendry follow the Brotherhood. Learning of the massacre at the Fist of the First Men, Rayder sends Snow with a band of Wildlings to scale the Wall and attack the Watch while it is weakened. The surviving men of the Night's Watch arrive back at Craster's Keep, where Tarly witnesses Gilly give birth to a son. Theon is freed from torture and captivity by an unknown man, who later rescues him again. Melisandre leaves Dragonstone for an unknown mission, stating that the blood of a King is required for victory. Daenerys agrees to buy all the 8,000 Unsullied and the translator Missandei for one of her dragons, against Selmy's and Jorah's advice. Jaime persuades his captor Locke not to let Brienne be raped, but Locke cuts off the former's sword hand.","show":"5b1c0f2f9fa7cda247ed23ae"},{"_id":"5b530d2de404d60e373113c1","number":4,"season":3,"title":"And Now His Watch Is Ended","__v":0,"fileName":"Game of Thrones S03E04.mp4","description":"Theon is betrayed by the rescuer, who returns him to the prison for torture. After a failed escape attempt, Jaime believes that he is lost without his sword hand; but Brienne, knowing what he did for her, urges him not to give up hope. Varys tells Tyrion how he became a eunuch, and that he now has in his power the magician who castrated him, advising Tyrion to be patient for vengeance. At Craster's keep, the surviving Night's Watchmen, starving, come into conflict with their host. Craster and Mormont are slain in the struggle, and Tarly flees with Gilly and her son. Arya and Gendry are taken to the secret cave of the Brotherhood, meeting their leader, Dondarrion, who later sentences Clegane to trial by combat with him. Margaery proposes marriage between Sansa and Loras. Daenerys meets with Kraznys to complete the trade of a dragon for the Unsullied army. She tests the Unsullied, then orders them to kill their former masters, reclaims her dragon and frees the Unsullied, who all decide to follow her freely.","show":"5b1c0f2f9fa7cda247ed23ae"},{"_id":"5b530d45e404d60e373113c2","number":5,"season":3,"title":"Kissed by Fire","__v":0,"fileName":"Game of Thrones S03E05.mp4","description":"Tyrion convinces Olenna to pay for part of the royal wedding. Sansa tells Baelish about her decision to stay in King's Landing. The Lannisters discover the Tyrells' plot to marry off Sansa to Loras. To prevent the union, Tywin plans to marry Sansa to Tyrion, and Cersei to Loras, despite the siblings' protests. Stannis confesses his infidelity to his wife, Selyse, who then tells him she already knows and approves of it. His daughter, Shireen, sneaks into the dungeon to visit Davos and starts teaching him to read. Sandor kills Dondarrion and is released. However, Dondarrion is resurrected seemingly by the power of the Lord of Light. Gendry decides to stay with the Brotherhood, and Thoros and Dondarrion plan to ransom Arya to Robb. After being delivered to Bolton, Jaime confesses to Brienne why he killed Aerys. Robb executes Karstark after the latter murders two captive Lannister boys. With the Karstarks abandoning him, Robb plans to make a desperate alliance with Frey. Jon Snow succumbs to Ygritte's seduction and breaks his vows. The Unsullied select a warrior called Grey Worm as their leader on Daenerys' order.","show":"5b1c0f2f9fa7cda247ed23ae"},{"_id":"5b530d7de404d60e373113c3","number":6,"season":3,"title":"The Climb","__v":0,"fileName":"Game of Thrones S03E06.mp4","description":"In King's Landing, Tywin coerces Olenna into agreeing to marry Loras to Cersei, who reveals to Tyrion that it was Joffrey who tried to have him killed during the siege. Tyrion confesses to Shae and Sansa about the upcoming marriage. Baelish tells Varys that he has caught Ros as Varys' informant and has given her to Joffrey, who kills her. In the Riverlands, Melisandre buys Gendry from the Brotherhood, foretelling that Arya will kill many people. Robb makes a new deal with Frey by agreeing to give him Harrenhal and marry his uncle Edmure to Frey's daughter, Roslin. Bolton plans to send Jaime to King's Landing, but refuses to send Brienne with him. At an unknown location, the mysterious man continues to torture Theon. In the North, tension arises between Osha and Meera. Beyond the Wall, Tarly continues his flight with Gilly and her son, while Snow and Ygritte manage to climb the Wall with two other Wildlings.","show":"5b1c0f2f9fa7cda247ed23ae"},{"_id":"5b530d97e404d60e373113c4","number":7,"season":3,"title":"The Bear and the Maiden Fair","__v":0,"fileName":"Game of Thrones S03E07.mp4","description":"In the North, Jojen tells Bran they must go beyond the Wall to find the raven, to Osha's horror. Snow and Ygritte's relationship deepens, making fellow Wildling Orell angry. Theon is emasculated by his torturer. Talisa reveals to Robb that she is pregnant. Arya runs away from the Brotherhood, only to be captured by Sandor. Melisandre reveals to Gendry that his father was Robert. Shae tells Tyrion that she will not continue their relationship once he marries Sansa. Tywin counsels Joffrey and discusses Daenerys, with the former dismissing the danger she might pose. Daenerys reaches the city of Yunkai and declares war on them. Bolton departs Harrenhall for Edmure's wedding while Jaime says farewell to Brienne and departs for King's Landing. On the road, he finds out that Locke refused Brienne's father's ransom. Jaime returns to Harrenhall to find Brienne in a pit fighting a bear. He leaps in and saves Brienne and departs once more, this time with her.","show":"5b1c0f2f9fa7cda247ed23ae"},{"_id":"5b530dade404d60e373113c5","number":8,"season":3,"title":"Second Sons","__v":0,"fileName":"Game of Thrones S03E08.mp4","description":"King's Landing hosts Tyrion and Sansa's wedding. Cersei shows displeasure upon Margaery and Loras. At the wedding feast Tyrion gets drunk and causes a scene, with Tywin demanding he make a baby soon. In their bedroom, Tyrion tells Sansa that they will not consummate their marriage until she wants to. Sandor reveals to Arya that they are heading for the Twins to ransom her to Robb. Stannis releases Davos, demanding he respect Melisandre, who arrives in Dragonstone with Gendry, whom she seduces and extracts blood from with three leeches. In a magical ritual, Stannis casts them into a fire naming three usurpers: Robb, Balon and Joffrey. Daenerys finds out that Yunkai has employed a mercenary company called the \"Second Sons\". One of the lieutenants named Naharis kills the other leaders and pledges his and the company's loyalty to Daenerys. Tarly and Gilly are attacked by a White Walker, whom the former destroys by the dragonglass dagger.","show":"5b1c0f2f9fa7cda247ed23ae"},{"_id":"5b530dd8e404d60e373113c6","number":9,"season":3,"title":"The Rains of Castamere","__v":0,"fileName":"Game of Thrones S03E09.mp4","description":"Tarly, Gilly and her son arrive at the Wall. During a thunderstorm, Bran enters Hodor's mind to calm him down, an ability not possessed by any Wildling. Nearby, Snow refuses to kill a farmer, whom Ygritte kills before Snow is attacked by the other Wildlings. Bran uses his warg ability to save Snow, who kills Orell before escaping, leaving a furious Ygritte behind with chief Tormund. Osha, Rickon and his direwolf depart for the Last Hearth, while Bran and his remaining company plan to go beyond the Wall. Daenerys sends Mormont, Naharis and Grey Worm to infiltrate Yunkai and open the city gate for her army. Yunkai soon falls to her forces. Robb arrives at the Twins and apologizes to Walder, who appears to accept. Edmure marries Roslin and they leave to consummate their marriage before Walder's men murder Catelyn, Talisa and most of the Stark bannermen, while Bolton, revealed to be loyal to the Lannisters, kills Robb. Arya also arrives at the Twins and witnesses a part of the massacre, but Sandor knocks her unconscious and carries her to safety.","show":"5b1c0f2f9fa7cda247ed23ae"},{"_id":"5b530deee404d60e373113c7","number":10,"season":3,"title":"Mhysa","__v":0,"fileName":"Game of Thrones S03E10.mp4","description":"The mastermind of the massacre is revealed to be Tywin, who awards the House Frey the Seat of Riverrun and appoints Bolton as the Warden of the North. Theon's captor is revealed to be Ramsay, Bolton's bastard who let the former's men leave Winterfell in exchange for surrendering him. Against Balon's wishes, Yara decides to rescue Theon. Arya and Sandor kill some Frey soldiers mocking Robb's death. Arriving in the capital with Brienne, Jaime is reunited with Cersei. In the North, Tarly's party encounters Bran's and gives them the Dragonglass weapons before arriving back at Castle Black, where he and Maester Aemon send ravens to alert the Seven Kingdoms about the White Walkers. Being hit several times, Jon still manages to escape from Ygritte and returns to Castle Black. In Dragonstone, Davos helps Gendry escape, while Stannis decides to head north and aid the Watch against the White Walker threat, forgiving the former and keeping him. In Essos, the freed slaves of Yunkai receive Daenerys as their \"mother\".","show":"5b1c0f2f9fa7cda247ed23ae"},{"_id":"5b530fdfe404d60e373113c8","number":1,"season":4,"title":"Two Swords","__v":0,"fileName":"Game Of Thrones S04E01.mp4","description":"Tywin oversees the reforging of Ice, the Stark ancestral sword, into two new swords, one for Jaime, who tries to deal with the loss of his sword hand and Cersei's love, and one for King Joffrey as a wedding present. Prince Oberyn Martell, on behalf of his brother, Prince Doran of Dorne, arrives in King's Landing with his paramour, Ellaria Sand, to attend the royal wedding and is welcomed by Tyrion. Oberyn openly reveals to Tyrion his motive for his visit: revenge against the Lannisters for the rape and murder of his sister, Elia, wife of Prince Rhaegar. In the North, while Styr and his group of cannibal Thenns reinforce Tormund, Ygritte, and the other wildlings, Jon is released by Maester Aemon after confessing what he did during his time with the wildlings to gain information. In the Riverlands, Arya and the Hound reclaim her sword, Needle, from Polliver, killing him and his men. In Essos, Daenerys leads her army on a march towards Meereen, the last of the three great slave cities, though she is troubled by how her dragons are becoming less tame as they grow.","show":"5b1c0f2f9fa7cda247ed23ae"},{"_id":"5b530ff7e404d60e373113c9","number":2,"season":4,"title":"The Lion and the Rose","__v":0,"fileName":"Game Of Thrones S04E02.mp4","description":"Roose Bolton returns to the Dreadfort, where he criticizes Ramsay for mistreating Theon, who has been brutalized into a subservient persona called 'Reek'. The former decides to find and kill the remaining Stark children, Bran and Rickon, who threaten the legitimacy of his new title, while tasking Ramsay to reclaim the territories under Ironborn occupation. In Dragonstone, Melisandre orders several people to be burned as a tribute to the Lord of Light, to the delight of Queen Selyse and the disgust of Davos and Shireen. In King's Landing, Tyrion ends his relationship with Shae to protect her from his family and has her shipped off to Pentos. Jaime begins training his left-handed swordplay with the help of Bronn. King Joffrey and Margaery Tyrell are wed. Later, at the Royal Wedding feast, tensions between Joffrey and Tyrion grow—just before the former succumbs to poisoned wine and dies. A grief-stricken Cersei accuses Tyrion of the murder and has him arrested, while Ser Dontos, a former knight, advises Sansa to leave with him in order to survive.","show":"5b1c0f2f9fa7cda247ed23ae"},{"_id":"5b531013e404d60e373113ca","number":3,"season":4,"title":"Breaker of Chains","__v":0,"fileName":"Game Of Thrones S04E03.mp4","description":"Tywin begins grooming Tommen to be the next king and enlists Oberyn and Mace Tyrell as his fellow judges for the impending trial of Tyrion, who decides to pick Jaime as his witness. Littlefinger, who hired Ser Dontos, kills him and smuggles Sansa out of King's Landing. In the Riverlands, Arya and Sandor encounter a benevolent farmer and his daughter, whom Sandor robs, to Arya's disgust. In Dragonstone, Davos tries to figure out how to replenish Stannis' depleted forces and requests a loan from the Iron Bank of Braavos to pay for a group of mercenaries called the \"Golden Company\". In the North, Sam, fearing for Gilly's safety, has her and the baby moved out of Castle Black to nearby Mole's Town. Meanwhile, the wildlings continue to raid northern villages. The Night's Watch receive word that the band of Night's Watch mutineers have set up camp at Craster's Keep. Jon tells the Watch to organize a party to attack the mutineers, as they cannot risk having any information about the weakness of Castle Black's defenses leak to Mance Rayder's approaching army. Daenerys lays siege to Meereen.","show":"5b1c0f2f9fa7cda247ed23ae"},{"_id":"5b53102ae404d60e373113cb","number":4,"season":4,"title":"Oathkeeper","__v":0,"fileName":"Game Of Thrones S04E04.mp4","description":"Daenerys successfully captures Meereen amidst a slave revolt and immediately seeks justice for the slain slave children by nailing 163 masters to posts. At sea, Littlefinger admits to Sansa that he was involved in Joffrey's death. In King's Landing, Olenna, who is planning to leave, also implies to Margaery that she was involved in the poisoning and convinces her to seduce Tommen before Cersei has a chance to turn him against her. Jaime meets with Tyrion and is convinced of his innocence. However, Cersei is adamant about Tyrion's guilt and orders Jaime to hunt down and kill Sansa. Jaime instead tasks Brienne with finding and protecting her, giving her both his Valyrian sword and Podrick as her squire. In the North, in an effort to get rid of Jon, Alliser Thorne and Janos Slynt conspire to allow Jon to lead an expedition against the mutineers, who have captured Bran's party and forced him to reveal his identity. Further north, a White Walker takes Craster's last newborn son to a secret ritual site, where he is transformed into a Walker.","show":"5b1c0f2f9fa7cda247ed23ae"},{"_id":"5b531040e404d60e373113cc","number":5,"season":4,"title":"First of His Name","__v":0,"fileName":"Game Of Thrones S04E05.mp4","description":"Tommen is crowned king. Cersei meets with Margaery, Tywin, and Oberyn, hoping to sway them to her advantage in the coming trial against Tyrion. In the Vale, Littlefinger takes Sansa to the Eyrie, where she is to pose as his niece. He is then pressured to marry Lysa Arryn that same day. It is revealed that the pair killed Jon Arryn while framing the Lannisters. On the Kingsroad, the Hound catches Arya practicing her water dancing and angers her by mocking that fighting style and Syrio Forel. On the road, Brienne finds out that Podrick has no practical skills as a squire. However, she is impressed with the fact that he killed a Kingsguard in order to protect Tyrion. Beyond the Wall, Jon's group attacks the mutineers. Locke attempts to kidnap Bran in the confusion but is killed by Hodor, warged into by Bran. Bran and his company then continue their trek north while Jon's party kills all of the mutineers and burns down Craster's Keep. In Meereen, after Jorah informs her about the fallback to slavery of Astapor and Yunkai, Daenerys decides to postpone her invasion of Westeros to bring order to Slaver's Bay and pronounces herself queen.","show":"5b1c0f2f9fa7cda247ed23ae"},{"_id":"5b53105de404d60e373113cd","number":6,"season":4,"title":"The Laws of Gods and Men","__v":0,"fileName":"Game Of Thrones S04E06.mp4","description":"In Essos, Davos manages to convince the Iron Bank to back Stannis while also resecuring Salladhor Saan and his pirates to Stannis' cause. In Meereen, Daenerys attempts to take on her new role as queen as she listens to the requests of her subjects, including nobleman Hizdahr zo Loraq and a man whose goats were killed by Daenerys' increasingly uncontrollable dragons. In the Dreadfort, Yara leads an attack in an effort to rescue Theon, who refuses to come with her, forcing her to escape. Ramsay rewards Theon for being obedient and, in order to take Moat Cailin, tasks him to pretend to be \"Theon\" instead of \"Reek\". In King's Landing, Tywin puts a bounty on the Hound's head and instructs Varys to continue spying on Daenerys. Later that day, Tyrion is brought to trial for Joffrey's murder. However, all of the witnesses brought in testify against him, including Ser Meryn Trant, Grand Maester Pycelle, Cersei, Varys and, to Tyrion's shock, Shae, who gives a solid testimony. Angry, humiliated, and defeated, Tyrion demands a trial by combat.","show":"5b1c0f2f9fa7cda247ed23ae"},{"_id":"5b531076e404d60e373113ce","number":7,"season":4,"title":"Mockingbird","__v":0,"fileName":"Game Of Thrones S04E07.mp4","description":"Cersei appoints Gregor Clegane as her champion in the upcoming trial by combat, while both Jaime and Bronn refuse to fight for Tyrion. Oberyn steps up, seeking a chance to avenge Elia by killing the Mountain, who raped and killed her during the rebellion. Daenerys has sex with Daario before sending him off on a mission to deal with the resurgent slavers at Yunkai. Melisandre and Selyse prepare for their departure from Dragonstone, intending to take Shireen as well. Alliser Thorne rejects Jon's offer to seal the tunnel. Brienne and Podrick meet Hot Pie and learn of Arya's adventures. They then resolve to travel to the Vale, deducing she would go there in search of living relatives. In the Vale, Lysa is enraged when she witnesses Littlefinger kissing Sansa. Later, she threatens to push Sansa through the Moon Door, but Littlefinger intervenes and pushes Lysa to her death.","show":"5b1c0f2f9fa7cda247ed23ae"},{"_id":"5b53108fe404d60e373113cf","number":8,"season":4,"title":"The Mountain and the Viper","__v":0,"fileName":"Game Of Thrones S04E08.mp4","description":"The wildlings attack Mole's Town. Gilly is discovered by Ygritte, who spares her. Ramsay forces Theon to get the Ironborn to surrender Moat Cailin. The Ironborn surrender in hopes of returning home but are flayed and slaughtered by Ramsay. As a reward for securing Moat Cailin, Roose legitimizes Ramsay as a Bolton. In the Vale, Sansa reveals to a council investigating Lysa's death her true identity and convinces the council of Littlefinger's innocence. While Littlefinger starts grooming Robin Arryn, Lysa's son, as the Lord of the Vale, the Hound and Arya arrive and are informed of Lysa's death. In King's Landing, the trial by combat starts. Oberyn gains the upper hand, but his desire to force the Mountain to confess his crimes gives the latter the chance to grab the former. He kills Oberyn by crushing his skull while confessing to the rape and murder of Elia. Tywin sentences Tyrion to death. In Essos, Barristan Selmy receives a letter intended for Jorah that pardons him as a reward for spying on Daenerys, who exiles him from Meereen as a result.","show":"5b1c0f2f9fa7cda247ed23ae"},{"_id":"5b5310a7e404d60e373113d0","number":9,"season":4,"title":"The Watchers on the Wall","__v":0,"fileName":"Game Of Thrones S04E09.mp4","description":"The Night's Watch prepares for the wildling invasion. Gilly and her son arrive at Castle Black, where Sam hides them in an underground room. The wildlings attack from both sides. Tormund's army gets through from the south and engages the Night's Watch. One giant manages to break through the tunnel leading into Castle Black but is killed by Grenn and five others, at the cost of their own lives. Alliser Thorne goes to fight in the southern part, leaving Janos Slynt in charge. However, Slynt proves to be incompetent and is tricked into going down the main level, effectively leaving Jon in charge. After watching Jon kill Styr, Ygritte prepares to kill him but is shot by Olly. Jon holds her in his arms as she dies. With the help of Jon's direwolf, Ghost, the Night's Watch secure the ground level of Castle Black, leading to Tormund's arrest. The wall climbers are obliterated by a massive scythe launched by the Watch. The wildlings retreat but not for long, Jon predicts. Seeing no other choice, Jon goes beyond the Wall to find and kill Mance Rayder.","show":"5b1c0f2f9fa7cda247ed23ae"},{"_id":"5b5310bfe404d60e373113d1","number":10,"season":4,"title":"The Children","__v":0,"fileName":"Game Of Thrones S04E10.mp4","description":"Jon's negotiation with Mance Rayder is interrupted when Stannis and his army overrun the wildling camp, taking Mance as prisoner on the former's suggestion. Bran's party comes upon the large heart tree from his visions but is attacked by skeletal beasts, who kill Jojen; the others are saved by a child, who takes them to the three-eyed raven, revealed to be an old man. In the Vale, Brienne and Podrick come across Arya and the Hound, whom Brienne engages and critically wounds. He begs Arya to kill him, but she refuses and leaves with Brienne searching for her. She enters a ship headed to Braavos, intending to reunite with Jaqen H'ghar. Meanwhile, in King's Landing, Cersei orders Qyburn to do anything to save the Mountain, who is poisoned by Oberyn's blade. She gets involved with Jaime, who releases Tyrion. Tyrion later finds Shae in Tywin's bed and strangles her to death. He then confronts Tywin in the privy and kills him, escaping the city with Varys. In Meereen, Daenerys is visited by a citizen who brings the charred remains of his daughter, who was burned by Drogon. As a precaution, Daenerys chains her two other dragons in the catacombs.","show":"5b1c0f2f9fa7cda247ed23ae"},{"_id":"5caa07edd42126042e50a9fb","number":7,"season":1,"title":"You Win or You Die","__v":0,"description":"In King's Landing, Ned tells Cersei he knows all of her children are Jaime's. They soon learn that Robert has been critically wounded by a boar while hunting. A dying Robert names Ned as the \"Protector of the Realm\" to rule until Joffrey reaches the legal age. Ned sends a message to Stannis, Robert's brother, intending to enthrone him since Robert has no true legal heirs. Ned tells Petyr Baelish about his plan and asks him to gain the loyalty of the City Watch, the only force capable of overpowering Lannister forces loyal to Cersei. After Robert's death, Ned, Baelish and the City Watch confront Cersei and Joffrey in the throne room, where Baelish and the City Watch betray Ned and attack his men. At the Wall, Ned's younger brother Benjen goes missing during a foray to the north, beyond the Wall. Snow and Tarly are picked as stewards, with Jon assigned to Lord Commander Mormont. The stewards swear their loyalties to the Night's Watch. In Essos, Robert's assassin is captured before he can poison Daenerys. Drogo vows to conquer the Seven Kingdoms and give that realm to his son. He starts marching towards Westeros.","fileName":"Game of Thrones S01E07.mp4","show":"5b1c0f2f9fa7cda247ed23ae"},{"_id":"5caa0b83d42126042e50a9fc","number":8,"season":1,"title":"The Pointy End","__v":0,"description":"Arya manages to escape the Red Keep after her Braavosian sword master delays the guards sent to arrest her, but Sansa is captured. Robb hears the news and prepares the Northern armies to fight the Lannisters, leaving Bran behind to rule Winterfell. Lysa refuses to fight the Lannisters, and Catelyn leaves to join Robb's camp. Tyrion and Bronn are surrounded by Shagga and his men. Tyrion convinces them to escort them to Tywin, who will repay them. They arrive at Tywin's camp, where the latter asks Shagga to help them in their confrontation with the Starks in exchange for even greater payment. Joffrey appoints Tywin as his Hand. Sansa begs Joffrey to show mercy upon Ned. Joffrey agrees if Ned publicly recognizes Joffrey's claim to the throne and admits to having committed treason. At the Wall, some bodies affected by the White Walkers are found. In Essos, Drogo's soldiers begin attacking nearby settlements, enslaving locals in order to sell them and gain the money to buy the ships necessary to cross the Narrow Sea.","fileName":"Game of Thrones S01E08.mp4","show":"5b1c0f2f9fa7cda247ed23ae"},{"_id":"5caa0b9ad42126042e50a9fd","number":9,"season":1,"title":"Baelor","__v":0,"description":"The Stark army arrives at the Twins castle; Catelyn convinces Lord Frey to let them pass and assist them, in exchange for her agreeing to the marriage of Robb and Arya to Frey's children in the future. Robb sacrifices 2,000 soldiers in a confrontation with the Lannister army, to capture Jaime. In a public hearing, Ned confesses to treason and publicly affirms Joffrey is rightful heir. However, rather than sentencing him to the Wall as had been negotiated, the vengeful Joffrey has him decapitated, while Sansa, and Cersei and other counselors object futilely. Sansa watches her father die, and Arya is present in the crowd. At the Wall, Jeor Mormont gives his family sword to Jon in gratitude, and Maester Aemon reveals to Jon that Aemon is a Targaryen. In Essos, Drogo's wound becomes septic and his death imminent. Daenerys convinces a slave woman to use blood magic to save him. The woman tells everyone to leave the tent and stay outside until the spell is over. Daenerys goes into labor, and Jorah brings her into the forbidden tent seeking aid.","fileName":"Game of Thrones S01E09.mp4","show":"5b1c0f2f9fa7cda247ed23ae"},{"_id":"5caa0bb3d42126042e50a9fe","number":10,"season":1,"title":"Fire and Blood","__v":0,"description":"The North secedes from the Seven Kingdoms and proclaims Robb as their king. With Jaime captured by the Starks and Robert's brothers challenging Joffrey's claim to the throne, Tywin appoints Tyrion as acting King's Hand, while Tywin fights to defend Joffrey's reign. Jon plans to desert his post at the Wall to avenge Ned and support Robb, but his friends convince him to honor his oath and stay. Jon then joins a Night's Watch expedition to find Benjen beyond the Wall. Yoren, a Night's Watch recruiter, helps Arya escape King's Landing disguised as a boy while Joffrey plans to make Sansa his queen despite her father's execution. Daenerys learns that her unborn son is dead, and Drogo has been left in a vegetative state due to the witch's treacherous magic. Daenerys ends Drogo's life. She places her three dragon eggs next to Drogo and lights a funeral pyre. She burns the witch alive on Drogo's pyre and walks into the flames herself. When the embers die the following morning, Daenerys rises, unharmed, flanked by three newborn dragons. Jorah and other witnesses kneel before her.","fileName":"Game of Thrones S01E10.mp4","show":"5b1c0f2f9fa7cda247ed23ae"}]